In [1]:
import numpy as np
import pandas as pd 
from  pandas import DataFrame, Series

In [2]:
data=Series(['one','two',np.nan,'three'])
data

0      one
1      two
2      NaN
3    three
dtype: object

In [3]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
data.dropna()

0      one
1      two
3    three
dtype: object

In [5]:
data.fillna(0)

0      one
1      two
2        0
3    three
dtype: object

In [10]:
dframe=DataFrame([[1,2,3],[2,np.nan,5],[3,4,np.nan],[np.nan,6,7],[np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  2.0  NaN  5.0
2  3.0  4.0  NaN
3  NaN  6.0  7.0
4  NaN  NaN  NaN

In [11]:
dframe.dropna() # opuszcza rzędy w których jest conajmniej jedno NaN

     0    1    2
0  1.0  2.0  3.0

In [13]:
dframe.dropna(how='all') # opuszcza tylko te rzedy ktore całe są NaN

     0    1    2
0  1.0  2.0  3.0
1  2.0  NaN  5.0
2  3.0  4.0  NaN
3  NaN  6.0  7.0

In [18]:
dframe.dropna(axis=1) #opuszcza kolumny w których jest conajmniej jedno NaN

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [25]:
dframe.dropna(thresh=2)  #opuszcza rzędy w których jest wiecej niz jedno NaN

     0    1    2
0  1.0  2.0  3.0
1  2.0  NaN  5.0
2  3.0  4.0  NaN
3  NaN  6.0  7.0

In [26]:
dframe.fillna(999)

       0      1      2
0    1.0    2.0    3.0
1    2.0  999.0    5.0
2    3.0    4.0  999.0
3  999.0    6.0    7.0
4  999.0  999.0  999.0

In [36]:
dframe.fillna({0:0,1:1,2:2,3:3,4:4})

     0    1    2
0  1.0  2.0  3.0
1  2.0  1.0  5.0
2  3.0  4.0  2.0
3  0.0  6.0  7.0
4  0.0  1.0  2.0